¿Qué diferencia hay entre una Serie y un DataFrame?

Es el turno de los DataFrames

Crea un array de dos dimensiones con 4 filas y 3 columnas.

- Convierte el array en un DataFrame donde las columnas se llamen "España", "Francia" e "Italia".

- Descarga el archivo "medallas" y carga el DataFrame.

- Usando el loc extrae todas las columnas de la fila de Tailandia.

- Usando el loc extrae todas las columnas de China e Irán.

- Usando el loc extrae solo las columnas de "Oro", "Plata" y "Bronce" de China e Irán.

- Usando el iloc extrae la información de la India. Devolved todas las columnas.

- Usando el iloc extrae todas las columnas de los países que estén en posición impar. La primera que nos tendría que salir es Japón y la última Corea del Norte.

- Utilizando el código del ejercicio anterior, selecciona unicamente las columnas "Oro", "Plata" y "Bronce".

Contesta a las siguientes preguntas:

- ¿Qué país consiguió más de 200 medallas de oro?

- ¿Qué país consiguió más de 200 medallas de oro y más de 1000 de plata?

- ¿Qué país consiguió más de 200 medallas de oro o más de 700 de bronce?

Crea una nueva columna que se llame "total" que sea el resultado de la suma de todas las medallas obtenidas por cada país.

In [1]:
import pandas as pd
import numpy as np

In [3]:
array_1 = np.random.randint(1,100, (4,3))
array_1

array([[72, 36, 59],
       [ 9, 64, 75],
       [51, 63, 29],
       [16, 98, 23]])

In [6]:
df= pd.DataFrame(array_1, columns=["España", "Francia", "Italia"])
df

   España  Francia  Italia
0      72       36      59
1       9       64      75
2      51       63      29
3      16       98      23

In [14]:
df_medallas = pd.read_csv("medallas.csv", index_col=1)
df_medallas

                 Unnamed: 0   Oro  Plata  Bronce
País
China                     1  1473    994     720
Japón                     2  1032   1037     985
Corea del Sur             3   745    663     827
Irán                      4   179    181     197
Kazajistán                5   155    158     224
India                     6   154    202     315
Tailandia                 7   132    175     278
Indonesia                 8   112    131     240
China Taipéi              9    99    144     276
Corea del Norte          10    91    120     235

In [15]:
tai = df_medallas.loc["Tailandia"]
tai

Unnamed: 0      7
Oro           132
Plata         175
Bronce        278
Name: Tailandia, dtype: int64

In [16]:
china = df_medallas.loc[["China","Irán"]]
china

       Unnamed: 0   Oro  Plata  Bronce
País
China           1  1473    994     720
Irán            4   179    181     197

In [17]:
china_iran = df_medallas.loc[["China","Irán"], ["Oro", "Plata", "Bronce"]]
china_iran

        Oro  Plata  Bronce
País
China  1473    994     720
Irán    179    181     197

In [22]:
df_medallas.index
df_medallas.index[5]

'India'

In [24]:
df_medallas.iloc[5]

Unnamed: 0      6
Oro           154
Plata         202
Bronce        315
Name: India, dtype: int64

In [25]:
df_medallas.iloc[1::2]

                 Unnamed: 0   Oro  Plata  Bronce
País
Japón                     2  1032   1037     985
Irán                      4   179    181     197
India                     6   154    202     315
Indonesia                 8   112    131     240
Corea del Norte          10    91    120     235

In [30]:
df_medallas.iloc[1::2, [1,2,3]]

                  Oro  Plata  Bronce
País
Japón            1032   1037     985
Irán              179    181     197
India             154    202     315
Indonesia         112    131     240
Corea del Norte    91    120     235

In [37]:
df_medallas.loc[(df_medallas["Oro"] > 200), "Oro"]

País
China            1473
Japón            1032
Corea del Sur     745
Name: Oro, dtype: int64

In [43]:
df_medallas.loc[(df_medallas["Oro"] > 200) | (df_medallas["Bronce"] > 700), ["Oro", "Bronce"]]

                Oro  Bronce
País
China          1473     720
Japón          1032     985
Corea del Sur   745     827

In [45]:
df_medallas["Total"] = df_medallas["Oro"]+df_medallas["Plata"]+df_medallas["Bronce"]
df_medallas.head()

               Unnamed: 0   Oro  Plata  Bronce  Total
País
China                   1  1473    994     720   3187
Japón                   2  1032   1037     985   3054
Corea del Sur           3   745    663     827   2235
Irán                    4   179    181     197    557
Kazajistán              5   155    158     224    537


Momento de trabajar con Series. Contesta a las siguientes preguntas:

Crea dos listas:

- Una que se llame "valores" que tenga 7 números aleatorios.

- Otra que se llame "indices" que tenga 7 strings que se llamen como los días de la semana.

A partir de estas dos listas crea una Serie donde la variable "valores" sean los valores de la Serie y la variable indices sean los índices de la Serie.

A partir de las dos listas anteriores crea un diccionario usando un bucle for. Para hacer esto tenemos el método zip que nos permite iterar por dos listas a la vez. Más información sobre este método aquí.

Crea una Serie con el diccionario creado en el punto anterior.

- ¿Qué forma tiene esta última Serie?

-¿Qué tipo de datos tiene?

- ¿Qué tamaño tiene?

- ¿Cuáles son los índices de la Serie?

- ¿Y los values?

Extrae el valor para el índice "lunes"

Extrae el valor para el índice "lunes", "martes" y "miércoles".

Extrae el valor para el índice "lunes" y "domingo".

In [65]:
valores = [1, 2,3,4,5,6,7]
indices = ["Lunes", "Martes", "Miércoles", "Jueves", "Viernes", "Sábado", "Domingo"]

indices

['Lunes', 'Martes', 'Miércoles', 'Jueves', 'Viernes', 'Sábado', 'Domingo']

In [66]:
serie = pd.Series(valores, indices)
serie

Lunes        1
Martes       2
Miércoles    3
Jueves       4
Viernes      5
Sábado       6
Domingo      7
dtype: int64

In [67]:

diccionario = {indices: valor for indices, valor in zip(indices, valores)}

"""diccionario={}

for indices, valores in zip (indices, valores):
    diccionario[indices]= valores"""
diccionario

{'Lunes': 1,
 'Martes': 2,
 'Miércoles': 3,
 'Jueves': 4,
 'Viernes': 5,
 'Sábado': 6,
 'Domingo': 7}

In [69]:
serie_dicc = pd.Series(diccionario)
serie_dicc

Lunes        1
Martes       2
Miércoles    3
Jueves       4
Viernes      5
Sábado       6
Domingo      7
dtype: int64

In [70]:
serie_dicc.shape

(7,)

In [71]:
serie_dicc.dtype

dtype('int64')

In [72]:
serie_dicc.size

7

In [73]:
serie_dicc.index

Index(['Lunes', 'Martes', 'Miércoles', 'Jueves', 'Viernes', 'Sábado',
       'Domingo'],
      dtype='object')

In [74]:
serie_dicc.values

array([1, 2, 3, 4, 5, 6, 7], dtype=int64)

In [75]:
serie_dicc["Lunes"]

1

In [76]:
serie_dicc["Lunes":"Miércoles"]

Lunes        1
Martes       2
Miércoles    3
dtype: int64

In [82]:
serie_dicc.loc[["Lunes","Domingo"]]

Lunes      1
Domingo    7
dtype: int64

Para realizar estos ejercicios deberéis usar el conjunto de datos de world-data-2023-part1.csv.

Selecciona todas las columnas de las filas 2 a 4 (inclusive) utilizando loc.

Utilizando loc, filtra el conjunto de datos para mostrar solo las filas donde la densidad (columna "Birth Rate") es mayor a 30.

Utilizando loc selecciona las columnas "Country" y "Capital/Major City" de las filas donde el porcentaje de tierra agrícola (columna "Fertility Rate") es superior al 3.

Selecciona todas las filas de las columnas 0 a 4 (excluyendo la columna 4) utilizando iloc.

Encuentra el valor en la fila 2 y columna 7 utilizando iloc.

Selecciona todas las filas para las columnas 0, 2, y 5 utilizando iloc.

Encuentra el valor de "Gasoline Price" para el país cuya abreviatura es "AL" utilizando loc.

Selecciona todas las columnas para el país cuya capital es "Tirana" utilizando loc.

Filtra el conjunto de datos para mostrar solo las filas donde el índice de CPI (columna "CPI") sea igual a 128.85.

Encuentra la densidad (columna "Density\n(P/Km2)") para el país cuya abreviatura es "AD" utilizando loc.

Selecciona las columnas "Country" y "Co2-Emissions".

Filtra el conjunto de datos para mostrar solo las filas donde el índice de CPI cambió un 2% (columna "CPI Change (%)").

Encuentra la tasa de natalidad (columna "Birth Rate") para el país con la abreviatura "AF" utilizando loc.

Selecciona todas las columnas de las filas 3 a 5 (excluyendo la fila 5) utilizando iloc.

Selecciona las columnas 1, 3 y 6 para todas las filas utilizando iloc.

In [85]:
df_world = pd.read_csv("world-data-2023_part1.csv")
df_world.head()

,Unnamed: 0,Country,Density\n(P/Km2),Abbreviation,Agricultural Land( %),Land Area(Km2),Armed Forces size,Birth Rate,Calling Code,Capital/Major City,Co2-Emissions,CPI,CPI Change (%),Currency-Code,Fertility Rate,Forested Area (%),Gasoline Price
0,0,Afghanistan,60,AF,58.10%,"652,230","323,000",32.49,93.0,Kabul,"8,672",149.9,2.30%,AFN,4.47,2.10%,$0.70
1,1,Albania,105,AL,43.10%,"28,748","9,000",11.78,355.0,Tirana,"4,536",119.05,1.40%,ALL,1.62,28.10%,$1.36
2,2,Algeria,18,DZ,17.40%,"2,381,741","317,000",24.28,213.0,Algiers,"150,006",151.36,2.00%,DZD,3.02,0.80%,$0.28
3,3,Andorra,164,AD,40.00%,468,NaN,7.20,376.0,Andorra la Vella,469,NaN,NaN,EUR,1.27,34.00%,$1.51
4,4,Angola,26,AO,47.50%,"1,246,700","117,000",40.73,244.0,Luanda,"34,693",261.73,17.10%,AOA,5.52,46.30%,$0.97

In [86]:
df_world.loc[2:4]

,Unnamed: 0,Country,Density\n(P/Km2),Abbreviation,Agricultural Land( %),Land Area(Km2),Armed Forces size,Birth Rate,Calling Code,Capital/Major City,Co2-Emissions,CPI,CPI Change (%),Currency-Code,Fertility Rate,Forested Area (%),Gasoline Price
2,2,Algeria,18,DZ,17.40%,"2,381,741","317,000",24.28,213.0,Algiers,"150,006",151.36,2.00%,DZD,3.02,0.80%,$0.28
3,3,Andorra,164,AD,40.00%,468,NaN,7.20,376.0,Andorra la Vella,469,NaN,NaN,EUR,1.27,34.00%,$1.51
4,4,Angola,26,AO,47.50%,"1,246,700","117,000",40.73,244.0,Luanda,"34,693",261.73,17.10%,AOA,5.52,46.30%,$0.97

In [93]:
#Utilizando loc, filtra el conjunto de datos para mostrar solo las filas donde la densidad (columna "Birth Rate") es mayor a 30.

df_world.loc[df_world["Birth Rate"] >30,].head()

,Unnamed: 0,Country,Density\n(P/Km2),Abbreviation,Agricultural Land( %),Land Area(Km2),Armed Forces size,Birth Rate,Calling Code,Capital/Major City,Co2-Emissions,CPI,CPI Change (%),Currency-Code,Fertility Rate,Forested Area (%),Gasoline Price
0,0,Afghanistan,60,AF,58.10%,"652,230","323,000",32.49,93.0,Kabul,"8,672",149.9,2.30%,AFN,4.47,2.10%,$0.70
4,4,Angola,26,AO,47.50%,"1,246,700","117,000",40.73,244.0,Luanda,"34,693",261.73,17.10%,AOA,5.52,46.30%,$0.97
18,18,Benin,108,BJ,33.30%,"112,622","12,000",36.22,229.0,Porto-Novo,"6,476",110.71,-0.90%,XOF,4.84,37.80%,$0.72
26,26,Burkina Faso,76,BF,44.20%,"274,200","11,000",37.93,226.0,Ouagadougou,"3,418",106.58,-3.20%,XOF,5.19,19.30%,$0.98
27,27,Burundi,463,BI,79.20%,"27,830","31,000",39.01,257.0,Bujumbura,495,182.11,-0.70%,BIF,5.41,10.90%,$1.21

In [ ]:
#Utilizando loc selecciona las columnas "Country" y "Capital/Major City" de las filas donde el porcentaje de tierra agrícola (columna "Fertility Rate") es superior al 3.

df_world.loc[(df_world["Fertility Rate"] >3), ["Country", "Capital/Major City"]].head()

         Country Capital/Major City
0    Afghanistan              Kabul
2        Algeria            Algiers
4         Angola             Luanda
18         Benin         Porto-Novo
26  Burkina Faso        Ouagadougou

In [96]:
#Selecciona todas las filas de las columnas 0 a 4 (excluyendo la columna 4) utilizando iloc.

df_world.iloc[0:4]

,Unnamed: 0,Country,Density\n(P/Km2),Abbreviation,Agricultural Land( %),Land Area(Km2),Armed Forces size,Birth Rate,Calling Code,Capital/Major City,Co2-Emissions,CPI,CPI Change (%),Currency-Code,Fertility Rate,Forested Area (%),Gasoline Price
0,0,Afghanistan,60,AF,58.10%,"652,230","323,000",32.49,93.0,Kabul,"8,672",149.9,2.30%,AFN,4.47,2.10%,$0.70
1,1,Albania,105,AL,43.10%,"28,748","9,000",11.78,355.0,Tirana,"4,536",119.05,1.40%,ALL,1.62,28.10%,$1.36
2,2,Algeria,18,DZ,17.40%,"2,381,741","317,000",24.28,213.0,Algiers,"150,006",151.36,2.00%,DZD,3.02,0.80%,$0.28
3,3,Andorra,164,AD,40.00%,468,NaN,7.20,376.0,Andorra la Vella,469,NaN,NaN,EUR,1.27,34.00%,$1.51

In [97]:
#Encuentra el valor en la fila 2 y columna 7 utilizando iloc.
df_world.iloc[2,7]

24.28

In [99]:
# Selecciona todas las filas para las columnas 0, 2, y 5 utilizando iloc.

df_world.iloc[[0,2,5]]

,Unnamed: 0,Country,Density\n(P/Km2),Abbreviation,Agricultural Land( %),Land Area(Km2),Armed Forces size,Birth Rate,Calling Code,Capital/Major City,Co2-Emissions,CPI,CPI Change (%),Currency-Code,Fertility Rate,Forested Area (%),Gasoline Price
0,0,Afghanistan,60,AF,58.10%,"652,230","323,000",32.49,93.0,Kabul,"8,672",149.9,2.30%,AFN,4.47,2.10%,$0.70
2,2,Algeria,18,DZ,17.40%,"2,381,741","317,000",24.28,213.0,Algiers,"150,006",151.36,2.00%,DZD,3.02,0.80%,$0.28
5,5,Antigua and Barbuda,223,AG,20.50%,443,0,15.33,1.0,"St. John's, Saint John",557,113.81,1.20%,XCD,1.99,22.30%,$0.99

In [104]:
#Encuentra el valor de "Gasoline Price" para el país cuya abreviatura es "AL" utilizando loc.

df_world.loc[df_world["Abbreviation"] == "AL", "Gasoline Price"]

1    $1.36
Name: Gasoline Price, dtype: object

In [105]:
#Selecciona todas las columnas para el país cuya capital es "Tirana" utilizando loc.

df_world.loc[df_world["Capital/Major City"]=="Tirana"]

,Unnamed: 0,Country,Density\n(P/Km2),Abbreviation,Agricultural Land( %),Land Area(Km2),Armed Forces size,Birth Rate,Calling Code,Capital/Major City,Co2-Emissions,CPI,CPI Change (%),Currency-Code,Fertility Rate,Forested Area (%),Gasoline Price
1,1,Albania,105,AL,43.10%,"28,748","9,000",11.78,355.0,Tirana,"4,536",119.05,1.40%,ALL,1.62,28.10%,$1.36

In [107]:
#Filtra el conjunto de datos para mostrar solo las filas donde el índice de CPI (columna "CPI") sea igual a 128.85.
df_world.loc[df_world["CPI"]== "128.85"]

,Unnamed: 0,Country,Density\n(P/Km2),Abbreviation,Agricultural Land( %),Land Area(Km2),Armed Forces size,Birth Rate,Calling Code,Capital/Major City,Co2-Emissions,CPI,CPI Change (%),Currency-Code,Fertility Rate,Forested Area (%),Gasoline Price
40,40,Costa Rica,100,CR,34.50%,"51,100","10,000",13.97,506.0,San Jos������,"8,023",128.85,2.10%,CRC,1.75,54.60%,$0.98